{
  "Projects": [
    {
      "title": "TheMino: Ordinary Domino Game",
      "desc": [
        "TheMino is a game that my team and I created for a final project in my university. The game is built python, pygame, and OpenGL. The game is a 2D game that is inspired by a Ludo game. The game has a few features such randomZone, and a 3D dice.",
        "RandomZone is a feature that allows the player to get a random number of steps. The 3D dice is a feature that allows the player to roll a 3D dice. The game also has a few other features menuy screen and also loading screen.", "Beside that the game also has a audio theme that will play when the game is started. The game also has a few sound effects such as dice roll sound, and a sound when the player win the game."
      ],
      "year": "2023",
      "preview": "No Live Preview Yet",
      "code": "https://github.com/AvanFabian/TheMino-OrdinaryDominoGame",
      "images": [
        "/projects/TheMino/mino1.png",
        "/projects/TheMino/mino2.png",
        "/projects/TheMino/mino3.png"
      ],
      "tech": [
        "Python",
        "Pygame",
        "OpenGL"
      ], 
      "slug": "themino"
    },
    {
      "title": "NeuRehab",
      "desc": [
        "NeuRehab is a Student Creativity Program project developed to assist post-stroke rehabilitation more effectively. The system combines an exoskeleton glove with an Arduino microcontroller, flex sensor for assistive motion, and pulse sensor. We also use Virtual Reality (VR) to train the patient's hand motor skills through interactive simulations.",
        "This project was born out of the need for a more efficient rehabilitation solution for stroke patients. NeuRehab allows patients to practice independently at home with the help of exoskeleton and VR, while monitoring their condition in real-time, thus accelerating recovery without relying entirely on physical therapists."
      ],
      "year": "2024",
      "preview": "No Live Preview Yet",
      "code": "Private",
      "images": [
        "/projects/chat/chat1.png",
        "/projects/chat/chat2.png",
        "/projects/chat/chat3.png",
        "/projects/chat/chat4.png"
      ],
      "tech": [
        "Android Studio",
        "Arduino",
        "ESP32",
        "HC-05",
        "C#",
        "Unity"
      ],
      "slug": "neurehab"
    },
    {
      "title": "Sch Education",
      "desc": [
        "Final Project of Innovation Management Lecture. SchEducation is simply an school online course, all of material provided by the Teacher there."
      ],
      "year": "2023",
      "preview": "https://sch-education.vercel.app/",
      "code": "https://github.com/AvanFabian/SchEducation",
      "images": [
        "/projects/schedu/schedu1.png",
        "/projects/schedu/schedu2.png",
        "/projects/schedu/schedu3.png",
        "/projects/schedu/schedu4.png"
      ],
      "tech": [
        "Javascript",
        "React",
        "React Router",
        "TailwindCSS"
      ],
      "slug": "schedu"
    },
    {
      "title": "Rumah Salad Faqiha",
      "desc": [
        "Aleph is a Discord bot that I created for my dircord server to use. The bot is built using Python and the discord.py library. The bot has image grabber feauture that takes argument (keywords) and returns an image from the internet.", "Other than that this bot has a few other features such as utility command to delete a messages, and a command to get the server's ping. This bot is still in development and I plan to add more features in the future."],
      "year": "2024",
      "preview": "",
      "code": "https://github.com/Alvalens/aleph-discord-bot",
      "images": [
        "/projects/bot/bot1.png",
        "/projects/bot/bot2.png"
      ],
      "tech": [
        "Python",
        "Discord.py",
        "Google Serp API"
      ],
      "slug": "aleph-discord-bot"
    }, 
    {
      "title": "LPTK Cup 2023 Website",
      "desc": [
        "LPTK Cup UM is a website that I created for a competition held by  the Universitas Negeri Malang. The website is mainly built using Laravel and Bootstrap. The website has a few features such as a registration form, a login system, article system, file upload,  and a dashboard for the admin to manage the contents.",
        "This project is my second freelance project, this project is not as big as my first freelance project but I learned a lot from this project. I learn how to manage a project and how to work with a team."
      ],
      "year": "2023",
      "preview": "",
      "code": "",
      "images": [
        "/projects/lptk/lptk1.png",
        "/projects/lptk/lptk2.png",
        "/projects/lptk/lptk3.png",
        "/projects/lptk/lptk3.png"
      ],
      "tech": [
        "PHP",
        "Laravel",
        "Bootstrap",
        "MySQL",
        "jQuery",
        "DataTables"
      ],
      "slug": "lptk-cup-2023"
    }, 
    {
      "title": "NU INO Website",
      "desc": [
        "My first freelance project. This project is a website for a School based on a JALAKAR curriculum. The website is built mainly using Laravel and Bootstrap.", "This website is LMS like system, have a user management, user auth, quiz and material for student and FAQ",  "In this project I learned how to work with a team and how to manage a project. I also learned new library such as livewire and alpine.js."],
      "year": "2023",
      "preview": "",
      "code": "",
      "images": [
        "/projects/ino/ino1.png",
        "/projects/ino/ino2.png",
        "/projects/ino/ino3.png"
      ],
      "tech": [
        "PHP",
        "Laravel",
        "Bootstrap",
        "Livewire",
        "MySQL",
        "jQuery",
        "DataTables"
      ],
      "slug": "nu-ino-website"
    },
    {
      "title": "Unmuh Jember Landing Page",
      "desc": [
        "Unmuh Jember landing page is a website that I created for a competition held by Universitas Muhammadiyah Jember. The website is built natively using HTML, CSS, and JavaScript. The website has a few features such as a registration form, a login system, and a dashboard for the admin to manage the contents.",
        "This project is my first freelance project and my first project using JavaScript. I learned a lot about how to use JavaScript and how to use it to create a website. I also learned how to work with a team and how to manage a project."
      ],
      "year": "2023",
      "preview": "https://alvalens.github.io/unmuh-jember-landing-page/",
      "code": "https://github.com/Alvalens/unmuh-jember-landing-page",
      "images": [
        "/projects/unmuh/unmuh1.png",
        "/projects/unmuh/unmuh2.png",
        "/projects/unmuh/unmuh3.png"
      ],
      "tech": [
        "HTML",
        "CSS",
        "JavaScript"
      ],
      "slug": "unmuh-jember-landing-page"
    },
    {
      "title": "My First Portofolio Website",
      "desc": [
        "This Project is my first portfolio website. This website is built using HTML, CSS, and JavaScript. First project that I deployed to the internet. Also my first time using Bootstrap.",
        "I learned a lot about web developement in this project. I Also learn how to use Git and Github. This project is the reason why I started to learn web development."
      ],
      "year": "2022",
      "preview": "https://alvalens.my.id",
      "code": "https://github.com/Alvalens/Alvalens-porto-1",
      "images": [
        "/projects/porto/porto1.png",
        "/projects/porto/porto2.png",
        "/projects/porto/porto3.png"
      ],
      "tech": [
        "HTML",
        "Bootstrap",
        "CSS",
        "AOS",
        "JavaScript"
      ],
      "slug": "my-first-portofolio-website"
    }
  ]
}
